<div class="page col-12 col-lg-10 col-xxl-9">
	<div class="page__wrap page__wrap--offer">
		<div class="page__title">
			<div class="page__greeting">
				<h2>Публичная оферта</h2>
			</div>
		</div>
		<div class="page__offer scroll-box">
			<div class="page__offer-body">
				<ol class="head">
					<li class="h3">Определения и термины
						<ol>
							<li>Оферта – настоящий документ, опубликованный на сайте Исполнителя, являющийся публичным предложением, адресованным неограниченному кругу лиц, заключить Договор на оказание образовательных услуг.</li>
							<li>Стороны Договора:
								- Исполнитель – ИП "Хадыкина Виктория Викторовна".
								- Ученик – физическое лицо, акцептовавшее Оферту. В случае, если Ученик является несовершеннолетним, все права и обязанности по настоящему Договору (включая оплату, коммуникацию и принятие решений) исполняются его законным представителем (родителем, опекуном), который и является стороной Договора.
							</li>
							<li>Акцепт оферты – полное и безоговорочное принятие Учеником (или его законным представителем) условий настоящей Оферты путем совершения оплаты за Учебный курс. Акцепт оферты создает Договор.</li>
							<li>Учебный курс – совокупность образовательных услуг, включающая 12 уроков по изучению кыргызского языка, предоставляемых Исполнителем в соответствии с заранее согласованным графиком.</li>
							<li>Информационные материалы – электронные учебные пособия, карточки, презентации, видеозаписи уроков и другие ресурсы, предоставляемые Ученику на время активного обучения.</li>
							<li>«Офлайн» обучение – формат предоставления услуг, предполагающий личное присутствие Ученика на занятиях по адресу, указанному Исполнителем. «Онлайн» обучение – формат предоставления услуг с использованием дистанционных технологий через интернет-платформы (например, Zoom).</li>
						</ol>
					</li>
					<li class="h3">Предмет и порядок предоставления услуг
						<ol>
							<li>Исполнитель обязуется предоставить, а Ученик – оплатить образовательные услуги по изучению кыргызского языка.</li>
							<li>Программа Учебного курса специально разработана для русскоязычных Учеников, начинающих изучение кыргызского языка «с нуля».</li>
							<li>Целью обучения является формирование у Ученика уверенных практических навыков для общения на бытовом уровне, включая понимание речи на слух, способность вести и поддерживать диалог.</li>
							<li>Ориентировочный полный курс для достижения заявленных целей рассчитан на 1 (один) год и строится на последовательном прохождении Учебных курсов по 12 уроков.</li>
							<li>Расписание занятий формируется для каждой группы отдельно и согласовывается с Учеником до начала обучения. Исполнитель обязуется уведомлять Ученика о любых изменениях в расписании заранее.</li>
							<li>Для онлайн-обучения Ученик обязан обеспечить наличие стабильного интернет-соединения и необходимого технического оборудования (компьютер/планшет/смартфон с микрофоном и веб-камерой).</li>
							<li>Обучение проводится по авторской методике. Контроль знаний может осуществляться посредством устных опросов, домашних заданий и периодических тестов по усмотрению педагога.</li>
						</ol>
					</li>
					<li class="h3">Обязанности сторон
						<ol>
							<li class="h4">Обязательства Исполнителя:
								<ol>
									<li>Проводить обучение по оригинальной методике с использованием современных интерактивных методов.</li>
									<li>Предоставлять Ученику на время активного обучения доступ ко всем необходимым Информационным материалам в электронном формате.</li>
									<li>При изменении графика обучения или переносе занятия, своевременно довести до сведения Ученика причины и новые даты.</li>
								</ol>
							</li>
							<li class="h4">Обязательства Ученика:
								<ol>
									<li>Своевременно и в полном объеме оплатить стоимость обучения.</li>
									<li>Посещать занятия, активно участвовать в процессе обучения и выполнять предписания педагога.</li>
									<li>Соблюдать регламент групповых занятий. Программа курса разработана для обеспечения равномерного прогресса всей группы. Ученик обязуется следовать программе и уважать учебное время других участников, не отвлекая группу на обсуждение индивидуальных вопросов или тем, выходящих за рамки текущего урока.</li>
									<li>Понимать, что доступ к Информационным материалам является привилегией активного участника курса и прекращается после завершения оплаченного периода обучения.</li>
								</ol>
							</li>
						</ol>
					</li>
					<li class="h3">Персональные данные и конфиденциальность
						<ol>
							<li>Акцептуя настоящую Оферту, Ученик (его законный представитель) дает свое согласие на сбор и обработку своих персональных данных (ФИО, возраст, номер телефона) с целью исполнения обязательств по Договору. Данные хранятся в течение всего срока обучения и 3 лет после его окончания.</li>
							<li>Исполнитель обязуется принимать все необходимые меры для защиты персональных данных Ученика от неправомерного доступа.</li>
							<li>Ученик соглашается на получение информационных сообщений, связанных с учебным процессом (напоминания о занятиях, изменения в расписании, оплате и др.), в специально созданном закрытом Telegram-канале, предназначенном для его учебной группы, а также через другие мессенджеры.</li>
						</ol>
					</li>
					<li class="h3">Права сторон
						<ol>
							<li class="h4">Исполнитель имеет право:
								<ol>
									<li>Не допускать Ученика до занятий в случае несвоевременной оплаты услуг.</li>
									<li>В случае значительного сокращения количества Учеников в группе, делающего дальнейшее обучение нерентабельным, Администрация оставляет за собой право расформировать такую группу, предложив оставшимся Ученикам перевод в другие действующие группы.</li>
									<li>В одностороннем порядке отказаться от исполнения Договора в случае существенного нарушения Учеником его условий, без возврата уплаченных средств.</li>
								</ol>
							</li>
							<li class="h4">Ученик имеет право:
								<ol>
									<li>Получать полную и достоверную информацию о предоставляемых образовательных услугах.</li>
									<li>Получать образовательные услуги надлежащего качества в соответствии с согласованным расписанием.</li>
								</ol>
							</li>
						</ol>
					</li>
					<li class="h3">Порядок взаиморасчетов и условия возврата
						<ol>
							<li>Стоимость Учебного курса 4000 сом за 12 уроков 3 раза в неделю по 1 часу.
							<li>Оплата за предстоящий Учебный курс (12 уроков) должна быть произведена не позднее, чем за 5 (пять) дней до его начала.</li>
							<li>Пропущенные занятия по инициативе или вине Ученика (включая болезнь) не компенсируются, не переносятся, и их стоимость не возвращается. Заморозка обучения не предусмотрена.</li>
							<li>В случае отказа Ученика от услуг после внесения оплаты за предстоящий курс, уплаченные денежные средства возврату не подлежат, так как Исполнитель несет расходы по формированию группы и бронированию места для Ученика.</li>
							<li>Оплата принимается только после согласования с Администратором и подтверждения наличия свободных мест в группе. Перевод денежных средств без такого подтверждения не является акцептом настоящей Оферты и не гарантирует зачисление в группу. В таком случае Исполнитель вправе вернуть средства за вычетом банковской комиссии либо предложить Ученикy альтернативную группу.</li>
						</ol>
					</li>
					<li class="h3">Интеллектуальная собственность
						<ol>
							<li>Все Информационные материалы, предоставляемые в рамках Учебного курса, являются объектом авторского права и интеллектуальной собственностью Исполнителя.</li>
							<li>Ученику предоставляется право на использование Информационных материалов строго в личных образовательных целях на время прохождения оплаченного курса.</li>
							<li>Категорически запрещается копирование, распространение, передача третьим лицам, публикация в сети Интернет и любое иное коммерческое или некоммерческое использование Информационных материалов без письменного согласия Исполнителя.</li>
						</ol>
					</li>
					<li class="h3">Техническая поддержка
						<ol>
							<li>Исполнитель оказывает базовую техническую поддержку, связанную с доступом к онлайн-платформам и Информационным материалам. Поддержка не включает консультации по настройке личного оборудования Ученика.</li>
							<li>В случае технических сбоев на стороне Исполнителя, приведших к срыву занятия, Исполнитель обязуется провести пропущенное занятие в полном объеме с переносом на ближайший по расписанию день занятий, с соответствующим сдвигом оставшихся занятий.</li>
						</ol>
					</li>
					<li class="h3">Оценка и контроль качества обучения
						<ol>
							<li>Оценка успеваемости Ученика осуществляется педагогом в ходе учебного процесса. Формальные аттестации или выдача сертификатов государственного образца по итогам курса не предусмотрены.</li>
							<li>Ученик имеет право на получение обратной связи о своей успеваемости от педагога.</li>
							<li>Спорные ситуации, связанные с работой педагогов, рассматриваются Администрацией Курсов.</li>
						</ol>
					</li>
					<li class="h3">Изменение и расторжение Договора
						<ol>
							<li>Исполнитель вправе в одностороннем порядке вносить изменения в настоящую Оферту, публикуя новую редакцию на сайте. Ученик обязан самостоятельно отслеживать такие изменения.</li>
							<li>В случае расторжения Договора по инициативе Ученика после начала оплаченного курса, стоимость неиспользованных уроков возврату не подлежит.</li>
						</ol>
					</li>
					<li class="h3">Порядок урегулирования споров
						<ol>
							<li>Все споры и разногласия, возникающие из настоящего Договора, стороны будут стремиться разрешить путем мирных переговоров.</li>
							<li>В случае невозможности достижения согласия, споры подлежат рассмотрению в суде в соответствии с законодательством Кыргызской Республики по месту нахождения Исполнителя.</li>
						</ol>
					</li>
					<li class="h3">12. Гарантии и ответственность сторон
						<ol>
							<li>Исполнитель гарантирует предоставление услуг в объеме и качестве, соответствующих условиям Договора.</li>
							<li>Ответственность Исполнителя ограничивается размером стоимости оплаченных Учеником, но не оказанных услуг.</li>
							<li>Исполнитель не несет ответственности за недостижение Учеником субъективно ожидаемых результатов, если услуги были оказаны качественно.</li>
						</ol>
					</li>
					<li class="h3">Форс-мажор
						<ol>
							<li>Стороны освобождаются от ответственности за неисполнение обязательств по Договору, если оно явилось следствием обстоятельств непреодолимой силы (форс-мажор).</li>
							<li>Сторона, для которой создалась невозможность исполнения обязательств, обязана в течение 5 дней уведомить другую сторону о наступлении форс-мажорных обстоятельств.</li>
						</ol>
					</li>
					<li class="h3">Порядок уведомлений и связи
						<ol>
							<li>Официальным каналом для уведомлений и связи является мессенджер (Telegram) и официальная группа в нём.</li>
							<li>Ученик несет ответственность за актуальность своих контактных данных и своевременную проверку сообщений.</li>
						</ol>
					</li>
					<li class="h3">Заключительные положения
						<ol>
							<li>Настоящий Договор-оферта заменяет собой все предыдущие устные и письменные договоренности между сторонами.</li>
							<li>Договор вступает в силу с момента его Акцепта и действует до полного исполнения сторонами своих обязательств. Договор автоматически пролонгируется на следующий Учебный курс при совершении Учеником очередного платежа.</li>
							<li>Первоначальный акцепт настоящей оферты Учеником действует в течение всего срока его непрерывного обучения. Оплата следующего курса является подтверждением согласия Ученика с действующей редакцией оферты.</li>
						</ol>
					</li>
				</ol>
			</div>
		</div>
		<div class="page__offer-btn">
			<button class="btn btn-lg btn-primary" type="button" id="offer_form_btn">Принять условия оферты</button>
		</div>
	</div>
</div>

<div class="popup popup--offer" id="popup_offer">
	<div class="popup__content">
		<div class="popup__header">
			<div class="popup__title"><div class="h4">Подтверждение</div></div>
			<div class="popup__close"><i class="fa-solid fa-xmark"></i></div>
		</div>
		<form id="offer_form" class="scroll-box" onsubmit="return false">
			<div class="popup__body popup__body--sections">
				<input type="hidden" id="mode" name="mode" value="create_consent">
				<input type="hidden" id="stud_id" name="stud_id" value="">

				<div class="ppsection">
					<div class="ppsection__header">
						<div class="ppsection__title">
							Данные родителя
						</div>
					</div>
					<div class="ppsection__content">
						<div class="popup__row">
							<div class="popup__col2">
								<input type="text" class="form-control form-control-lg" id="phone" name="phone" required>
								<label for="phone" class="placehold">Номер телефона</label>
								<div class="duplicates duplicates--offer is-active" id="duplicateBox">
									<div class="close-abs">
										<button type="button" class="btn-close close-card-body" role="button"></button>
									</div>
									<div class="duplicates__list"><div class="duplicates__item" data-stud="8"><div class="duplicates__col">Александр Морозов null</div><div class="duplicates__col">21.04.26.00008</div><div class="duplicates__col">555789017</div><div class="duplicates__col">null</div></div></div>
								</div>
							</div>
							<div class="popup__col2">
								<input type="text" class="form-control form-control-lg" id="last_name" name="last_name" required>
								<label for="last_name" class="placehold" class="placeholder">Фамилия</label>
							</div>
							<div class="popup__col2">
								<input type="text" class="form-control form-control-lg" id="first_name" name="first_name" required>
								<label for="first_name" class="placehold">Имя</label>
							</div>
							<div class="popup__col2">
								<input type="text" class="form-control form-control-lg" id="patronymic" name="patronymic">
								<label for="patronymic" class="placehold" class="placeholder">Отчество <small>(не обязательно)</small></label>
							</div>
							<div class="popup__col2">
								<input type="text" class="form-control form-control-lg calc-age" id="birthday" name="birthday" required>
								<label for="birthday" class="placehold">Дата рождения</label>
							</div>
							<div class="popup__col2">
								<input type="text" class="form-control form-control-sm form-control-age" readonly disabled id="age" name="age" placeholder="0 лет">
							</div>
						</div>
					</div>
				</div>

				<div class="ppsection">
					<div class="ppsection__header">
						<div class="ppsection__title">
							Дети (ученики)
						</div>	
						<div class="ppsection__btn">
							<button type="button" id="add_child" class="btn btn-sm btn-icon btn-info"><i class="fa-solid fa-plus"></i> Добавить ребенка</button>
						</div>
					</div>
					<div class="ppsection__content child-area" id="child_area">
						<div class="child child--template" id="child_block_temp">
							<div class="child__header">
								<div class="child__title">Ребенок 1</div>
								<div class="child__close"><i class="fa-solid fa-xmark"></i></div>
							</div>
							<div class="popup__row">
								<div class="popup__col2">
									<input type="text" class="form-control form-control-lg" id="child_first_name0" name="child_first[]">
									<label for="child_first_name0" class="placehold">Имя</label>
								</div>
								<div class="popup__col2">
									<input type="text" class="form-control form-control-lg" id="child_last_name0" name="child_last[]">
									<label for="child_last_name0" class="placehold" class="placeholder">Фамилия</label>
								</div>
								<div class="popup__col2">
									<input type="text" class="form-control form-control-lg child-birthday calc-age" id="child_birthday0" name="child_birthday[]">
									<label for="child_birthday0" class="placehold">Дата рождения</label>
								</div>
								<div class="popup__col2">
									<input type="text" class="form-control form-control-sm form-control-age" readonly disabled id="age0" name="age0" placeholder="0 лет">
								</div>
							</div>
						</div>
					</div>
				</div>

				<div class="ppsection">
					<div class="form-check">
						<input class="form-check-input" type="checkbox" id="agree" name="agree" value="agree" required>
						<label class="form-check-label placehold" for="agree">
							Я подтверждаю, что ознакомлен(а) с условиями и даю согласие от своего имени и от имени указанных детей.
						</label>
					</div>
				</div>

				<div class="popup__footer">
					<button type="submit" id="sign_agreement" class="btn btn-lg btn-info w-100">Подписать</button>
				</div>
			</div>
		</form>
	</div>
</div>

<div class="popup popup--offer-result" id="popup_offer_result">
	<div class="popup__content">
		<div class="popup__header">
			<div class="popup__title"><div class="h4">Результат</div></div>
			<div class="popup__close"><i class="fa-solid fa-xmark"></i></div>
		</div>
		<div class="popup__body">
			
		</div>
	</div>
</div>